/**
 * Project Name:java-basic
 * File Name:Sample.java
 * Package Name:com.easyway.java.basic.memory
 * Date:2015-3-23上午10:13:53
 * Copyright (c) 2015, longgangbai@sina.com All Rights Reserved.
 *
*/

package com.easyway.java.basic.memory;
/**
 * ClassName:Java 线程的运行机制 <br/>
 * Function: 在java虚拟机进程中，执行程序代码的任务是线程来完成的，每个线程都有一个程序计数器和方法调用栈。
 * 程序计数器：PC寄存器，当线程执行一个方法时候，程序计数器指向方法区中下一条要执行的字节码指令。
 * 方法调用栈：方法栈用来跟踪线程运行中一系列的方法调用过程，栈中的元素称为栈祯。每当线程调用一个方法的时候，
 * 就会向方法栈压入一个新 祯。祯用来存储方法的参数，局部变量和运算过程中的临时数据。
 * <br/>
 * Reason:	 
 * 栈祯 由以下三部分组成。
 *    局部变量区：存放局部变量和方法参数。
 *    操作数栈：是线程的工作区，用来存放运算过程中的生成的临时数据。
 *    栈数据区：为线程执行指令提供相关的信息，包括如何定位到位于堆区和方法区的特定数据，以及如何正常退出方法或者异常中断方法。
 * <pre>
 * ————————————————————————————————--       -----------------------
 * |    java栈区                                                     |       |   堆区                                       |         |————————————方法区————————————————————
 * |                                |       | ---------------------|         |                                |  
 * |    -----------------------     |       |   Sample 对象                       |         |      ————————————————————      |
 * |    |    method()方法的栈祯      |    |       |     实例变量a          |         |      |   Sample类的数据结构    |     |
 * |    |--------------------- |    |       |                      |         |      |  ————————————————— |    |
 * |    |       局部变量b        |    |       | —————————————————————|         |      |  method()方法字节码      |    |  
 * |    | _____________________|    |                                        |      |        代表a++操作指令|    |  
 * |    | main()方法的栈祯                   |    |                                        |      |        ....        |    |      
 * |    | ---------------------|    |       |———————————————————|            |      |————————————————————     |  
 * |    |     局部变量s          |    |       |   主线程的程序计数器    |             |      |   main()方法的字节码  |                                  |  
 * |    |     局部变量a          |    |       ————————————————————             |       ————————————————————     |  
 * |    ---------主线程方法栈------    |                                        |                                |  
 * |                                |                                        |                                |  
 *  ————————————————————————————————                                          ————————————————————————————————
 * 
 * 方法区：存放了线程所执行的字节码指令，实例方法和静态方法的字节码都位于方法区，被所有的线程共享。
 * 堆区：存放了线程所操控的数据以对象的形式存放。
 * java栈区：线程的工作区，保存线程的运行状态。
 * </pre>   
 *    
 *  <br/>
 * Date:     2015-3-23 上午10:13:53 <br/>
 * @author   longgangbai
 * @version  
 * @since    JDK 1.6
 * @see 	 
 */
public class MemoryStyle {
    private int a;//实例变量
    public int method(){
        int b=0;//局部变量
        a++;
        b=a;
        return b;
    }
    public static void main(String[] args) {
        MemoryStyle s=null;//局部变量
         int a=0;
         s=new MemoryStyle();
         a=s.method();
         System.out.println(a);
    }

}

